export default {
  // 密码：8-24位，至少为字母数字组合，特殊字符也可
  // password: /^(?=.*\d)(?=.*[a-zA-Z])(?=.*[~!@#$%^&*_-])[\da-zA-Z~!@#$%^&*_-]{8,24}$/,
  password: /^(?=.*\d)(?=.*[a-zA-Z])(?=.*[~!@#$%^&*_-])[\da-zA-Z~!@#$%^&*_-]{8,24}$|^(?=.*\d)(?=.*[a-zA-Z])[\da-zA-Z]{8,24}$/,
  // 邮箱
  // mail: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
  // 手机号
  phone: /^1[0-9]{10}$/,
  // 手机号或邮箱
  // phoneOrMail: /(^0{0,1}1[0-9]{10}$)|(^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$)/,
  // 公司名称
  firmName: /^[\u4e00-\u9fa5A-Za-z0-9（）()]+$/,
  // 中英文空白字符
  word: /(^[\u4e00-\u9fa5A-Za-z]+$)|(^[A-Za-z]+\s[A-Za-z]+$)/,
  // 账号：汉字、字母、数字、_
  // account: /^[\u4e00-\u9fa5A-Za-z0-9_]+$/,
  // 地址：汉字、字母、数字
  address: /^[\u4e00-\u9fa5A-Za-z0-9]+$/,
  // 设备编号
  // machineSequence: /^[A-Z]{1,11}\-?\d{1,11}$/,
  machineSequence: /^(?=.*\d)(?=.*[a-zA-Z])[\da-zA-Z]{10,30}$/,
  // 节点编号
  boxSequence: /^[A-Z]{0,11}\d{1,11}$/,
  // 版本号 1-99
  version: /^[1-9][0-9]?$/,
  // 英文和数字
  deviceType: /^[\u4e00-\u9fa5A-Za-z0-9]+$|^[\u4e00-\u9fa5A-Za-z0-9]+\-?[\u4e00-\u9fa5A-Za-z0-9]+$/,
  // 节点软件版本
  boxVersion: /^[A-Za-z0-9]+$|^[A-Za-z0-9]+\.?[A-Za-z0-9]+$/,
  landline:/^(\+\d{2}(-|\s))?0(\d{2}-\d{8}|\d{3}-\d{7,8})(-[0-9]{4})?$/,
  mail:/^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/

};
